{"entries":[{"title":"About leading 18F projects","url":"/about-leading-18f-projects/","tags":[],"body":"This is a guide to a project lead’s responsibilities and decisions at the beginning of a project. This guide covers: Initial tasks, research, and discussions with your business unit Getting started with your team Choosing your team’s tools, processes, and meetings What to discuss in your first meeting with your partner agency Planning your project’s kickoff workshop with your partner General advice and suggestions for a happy team and partner As a project lead, you’re responsible for the strategy, roadmap, and feature definition of a product or project. Your work will vary depending on the type and size of your project, but it’s always your job to support your team as a servant leader and a sh-t umbrella. Protect your team from bureaucracy, paperwork, and politics. Remove blockers. Help design your team’s processes so that momentum is on your side and the system must put effort into slowing you down, instead of waiting for approvals at every step. Simultaneously, collaboration with our partners is crucial (we tend to use the term partner agency instead of client). Many of the recommendations in this document are designed to help you ensure everyone understands and agrees upon the mission, vision, and goals of the project. Staying in good communication and preventing surprises is crucial. We are often asking our partners to work in a totally new and different way. We’re asking them to abandon their traditional approach to contractors as well as many of the ways they traditionally manage risk, for example, by writing rigid, exhaustive plans and requirements. You will need them to help provide your team top cover, and the easier you can make this, the better your project will function. Most importantly, our project work alone is not our true, lasting impact. We believe that the American people deserve excellent and efficient services, and that the best way to deliver them is through human-centered design, open source software, transparency, and agile methodologies. Our project work is impactful when it proves this and makes believers of our partners and stakeholders."},{"title":"Choose your tools","url":"/starting-a-new-project/choose-your-tools/","tags":[],"body":"As a team, agreeing early about team processes, communication styles, and meetings will improve your workflow and help prevent common miscommunications. Importantly, many teams have found that including your partner agency in as many of these processes and meetings as feasible helps build crucial understanding and trust. However, you may also find that technical and jargon-heavy meetings, for example, are not the best use of your partners’ time. Instead, a short daily stand up might be sufficient. Finding the right balance is often an evolving process, and retros are one of the best ways to find that right balance. Most importantly, frequent communication is incredibly valuable for building relationships and trust as well as removing blockers for your team. While choosing processes and tools, consider these questions for your partner: Can they access our tools? (For example, GSA only allows the use software listed in its IT Standards List.) Discuss Slack, GitHub, and video chat. Offer training. If your partner can use these tools, your life will be much easier (and your teams’ relationship better). (The 18F Handbook has guidance on inviting partners to Slack.) What is their availability? Share yours. Share the best way to reach each other if it’s urgent. Another crucial principle to keep in mind when making these decisions is our core value of “default to open.”” Sharing code and drafts with as many people as possible as early as possible significantly reduces surprises and builds trust and understanding. Discomfort with imperfection is not a sufficient reason for private repos in this organization. Learn more about our open source policy."},{"title":"Communication and rituals","url":"/starting-a-new-project/communication-and-rituals/","tags":[],"body":"Foundational team processes We practice agile, but we don’t specify an instantiation — many teams use scrum or kanban (or a version of them). To coordinate across multiple teams, some projects use Scaled Agile Framework (SAFe). You can reach out to the agile guild for advice on #g-agile. Prior to starting work on the project, your team should define standards for creating backlog issues. Many teams like to follow a system by which each issue/card contains a title, user story, some background or context, and completion or acceptance criteria. For example, this is the FEC team’s guide for writing a good issue, or the Gherkin style of writing software requirements. Likewise, it’s a best practice to make sure each of your user stories align with one of your project’s higher-level epics or goals, and reference a product persona or prioritized user. Some teams keep a running notes doc for each sprint for their goals, meeting agendas, and notes. This can also be used to inform your release notes, which are a great way to share updates with your users and document your progress. For additional team practices, see next steps. Dev team processes This development guide includes many of the technical tools, processes, standards, and documentation that we include in our projects. Consider reviewing it with your engineers (or encourage your engineers to review it). The engineering team is also building a command line tool that creates all of the engineering components and documents that our projects need in their GitHub repo (see #eng-scaffolding for questions). Develop policies for pull requests (submitting, reviewing, and merging them) and for testing (unit, integration, and feature). Here is an example of the FOIA team’s team practices. Onboarding new team members can be a great way to test if your documentation is sufficiently thorough, clear, and accurate for a good open source project. Also, check out 18F’s pen source guide. We also have guides for certain standards of quality. Some of them include the API standards, front end style guide, accessibility, and more in the 18F Guides. Communication Clear communication is central to every team’s success. We are spread across the country, and we use a “distributed-first” model for our teams. This means primarily using distributed tools for interacting. For example, even if some members of your team are physically co-located, you should hold your meetings from your separate desks over video chat so that everyone can see and hear folks. These 18F blog posts offer more guidance: 18F’s best practices for making distributed teams work Making a distributed design team work We communicate primarily via Slack. The 18F handbook has an extensive guide to Slack, including channel naming conventions. For video chats, Google Hangouts is integrated into our calendar meeting invites and effective for meetings up to 25 people. For larger meetings, we use Zoom. The 18F handbook has guides for Google Hangouts and Zoom. Make sure you are considering your partner’s needs and restrictions here. Before deciding, discuss with your partner: Are they facing any significant restrictions on their access to our tech? Discuss Slack, GitHub, and video chat. Offer training. If you can get your partner to use these tools, your life will be much easier (and your teams’ relationship better). (The 18F Handbook has guidance on inviting partners to Slack.) What are their normal hours of availability? Share yours and your team’s. Let them know the best way to reach you if it’s urgent. Rituals and meetings Decide on the time of day, day of the week, and format for major meetings. The 18F agile guide has a summary of agile rituals. This guide assumes that you are familiar with these basic practices; here are some tips for what to expect at 18F: Stand up: Share what was done yesterday, what you plant to do today, and any blockers. Some teams share this on slack prior to a video stand up. Most teams prefer video stand ups, but some use Slack. Either way, some teams find it helpful to set an automatic @channel reminder at the start time. Resolving the blockers – which are often raised in stand up – is one of your primary roles as a project lead. Before starting, check for open pull requests that need a reviewer. Keeping a running notes doc for all your meetings can be very useful later. Make sure you share the task of taking notes across the team. Sprint planning Many project leads prefer to groom issues prior to sprint planning. Ping your team before sprint planning to make sure the issues are all up to date before starting. Teams can differ greatly on point estimation. Some teams simply use small/medium/large and others use the traditional fibonacci sequence. For example, the FEC team estimates 1, 2, or 3 (analogous to small/medium/large) and then after all of the issues for the sprint have been assigned but before the end of sprint planning, team members individually review the work assigned to them. They then discuss as a team if the workload is reasonable and realistic, and adjust and prioritize as necessary. Backlog grooming and sprint check in: This involves reviewing and updating your backlog, and then prioritizing the issues with your partner agency. It can be easier to prepare points of discussion, take notes during the meeting, and then update the issues later, instead of juggling video chat and GitHub during the meeting. End-of-sprint ceremonies: Sprint review: If your team is in the habit of writing release notes, these notes can be a useful guide for items to demo. Retros are crucial to a cohesive, effective team. You should do them every sprint. Some teams occasionally include their partner in retros. Some project leads prefer to lead retro; some teams rotate the leader of the retro throughout the team. Release sync: Most teams aim to publicly launch updates at least every other sprint. A regular launch timeline and a pre-launch sync with the team can be useful. This is an example of the FEC team’s release checklist. Epic planning (usually every ~6 sprints or quarterly) Review your goals, vision, and strategy in this meeting. Are you still on track? Does your vision still make sense? Do you need to pivot? This is also a good time to onboard new team members and hold a larger retro with your team and your partner agency. You might want to fly your team in town for this if you will be taking on a large new chunk of work or starting work with a new part of the partner agency. Periodic in-person meetings like this can pay off significantly in the future for team cohesion, collaboration, and trust. Coordinate travel with your business unit. The 18F Handbook has an overview of meetings and related meeting tools, written for a broader audience."},{"title":"First Steps","url":"/starting-a-new-project/first-steps/","tags":[],"body":"Start a README Start building a project document right away. Your README should capture the most important information from your conversations with the business unit, your team, and other key players, but you should try to keep it short and evergreen. This will simplify the onboarding process and serve as a valuable reference for your team. Your README could include: Project description and vision The cascading strategy: How does your project fit into your partner’s and our organizational mission and goals from TTS down to your project? Background info: Do some initial research into your partner agency and the laws and regulations that affect your project. Wikipedia and Vox are great starting places. The tock code to bill your time Common jargon and acronyms Links to your tools, like your github repos, a notes document, business documents like your SOW, your Google Drive folder Some project README examples include: FOIA project README Alaska medicaid project’s README Meet with your business unit Ask your business unit who will be responsible for managing your budget, travel, contract issues, and more. If you’re working with the Custom Partner Solutions (CPS) business unit, they manage this centrally. Review any intake documentation from your business unit’s initial project reviews or scoping conversations. Review the IAA/SOW. This is our contract with your partner agency, so you should be very familiar with it. However, keep in mind that relying on a contract to resolve a problem or disagreement is a worst case scenario. Then, ask your business unit what isn’t on paper. Contracts are always a negotiation between us, your partner, and everyone’s lawyers. Was anything contentious or removed? Who was involved on the partner agency’s side? Ask why we decided to take on this project and if there is anyone else at TTS who might have valuable insight on the project or partner agency. Discuss possible red flags. Meet your team Hold an initial kickoff meeting with your team to discuss: Names, preferred pronouns, locations, and timezones Where to find your project’s documents, especially the README Why folks are interested in this project and any concerns or questions they might have Clarify everyone’s roles and what that means to them. What are their primary skills? What do they find challenging or stressful? Depending on their expertise and the size of your team, working with the chapters to identify leads for design and engineering is a good practice. Summarize anything important from your meeting with the business unit The tock line for billing time, how many hours everyone is expected to bill per week, and what to do if that needs to change Whom to notify about additional expenses (for example, cloud.gov quota increases, travel, or help from people outside of the team) Expectations of availability and response times Ensure everyone’s emergency contact information is up to date. Discuss everyone’s participation in research. We have found that projects are much more successful when all team members (including engineers) are involved in discovery research, brainstorming, and usability testing. Building a cross-functional team with a shared understanding of the problem space is crucial to good decision making, brainstorming, and innovation. It is also a core tenet of agile development. As an example, engineers need to make more decisions in development than designers can (or should) prescribe. Making good decisions is easier when the whole team has a shared understanding of the users and the problem space. Meet with your partner agency Some initial points of discussion that we recommend include: Thank the partner agency for hiring us. Check in on their feelings toward us at this point. The IAA process can be difficult and stressful. Are they frustrated? Excited? Behind schedule? Do you need special access to their systems, buildings, and so on? Who approves travel? Where do you send invoices? Ask them about the SOW, and what’s in it and what’s not (similar to the discussion with your business unit). Schedule a regular check in between you and your partner (many PMs schedule a weekly or biweekly meeting). This is an effective way to discuss progress, prioritize goals, request help with blockers, answer questions and explain jargon (on both sides), and, most importantly, catch issues and anxieties before they become real problems. Encourage your partner to participate in design research and usability testing – and ask that they invite any skeptics as well. This can be very powerful and convincing when discrepancies eventually arise between stakeholder and user needs. Request read aheads about the agency or project, their org chart, bureaucracy to expect, special challenges and interoffice politics, and more. Sometimes, these are helpful and important because they’ll allow the team to accomplish more and take better advantage of the time they’re physically present for the workshops. Sometimes, this content doesn’t make sense without an explanation from your partner, and spending a lot of time reading through obscure/jargony docs isn’t a good use of your team’s time. You’ll have to play it by ear. Discuss timelines and when you should fly the team in town for a kick off meeting. Ask them if they would be willing to provide introductory lessons about the project and agency."},{"title":"Welcome","url":"/","tags":[],"body":"This guide is for people at 18F who are wondering what to expect from a product manager on their team, as well as for product managers and those filling that role to understand what their team should expect from them. This guide also serves as a resource for product management best practices at 18F (generalized to apply to any of the specific types of product work we do, like Custom Partner Solutions (CPS) projects, product or platform work, consulting, etc.)"},{"title":"Introduction","url":"/","tags":[],"body":"{% include head.html %} Skip to main content {{site.title}} {{site.description}} {% jekyll_pages_api_search_interface %} {% for nav in site.navigation %} {% if nav.url == nil %}{% continue %}{% endif %} {% if nav.children == nil %} Test {% endif %} {% unless nav.children == nil %} {{ nav.text }} {% if nav.blurb %}{{ nav.blurb }}{% endif %} {% for child in nav.children %} {% if child.children != nil %} {{ child.text }} {% for grandchild in child.children %} {{ grandchild.text }} {% endfor %} {% else %} {{ child.text }} {% endif %} {% endfor %} {% endunless %} {% endfor %} {% include site-footer.html %}"},{"title":"Resources","url":"/resources/","tags":[],"body":"Discovery research After kicking off your project, your team will get started on discovery research. As described above, including your whole team in the research and user interviews is best practice. If you have questions about design next steps, reach out to the design team or review the design wiki. - The lean product design guide is an excellent next step to follow this guide. Check the other 18F guides for help as well. - Write your weekly ship! Writing a weekly summary is strongly encouraged. We recommend this communication device based on comprehensive research into what makes our projects successful. One approach is to gather a list of bullet points in a Friday meeting with your team; reviewing the week’s accomplishments can be a powerfully positive exercise for the team. Learn more about the weekly ship here. - After about 3-4 weeks of discovery research, you might want to bring everyone back in town to share your research and findings with your partner. Here is a sample briefing. Ending and transitioning your project The following are guides and resources for finishing your project, but you should familiarize yourself with them at the beginning of your project. - Our Before You Ship guide is actually full of VERY IMPORTANT issues to understand at the beginning of your project (because they will ultimately affect your launch and the commitments you can make). Pay special attention to the section about ATOs. You cannot launch a project – or even discuss potential launch dates with your partner – before you have an ATO. - Similarly, you should review the transition guide at the beginning of the project. - Once your team is building and releasing features – usually after an initial discovery phase – you will also need to incorporate feature testing in your sprint cycle. - Users: Testing with users at least once per sprint is a best practice. The FEC team developed a graphic to explain how they manage this. - Partners: Often, teams push updates to a staging server so their partner can review, test, approve them before public release. If you keep release notes, these can be used as a checklist for feature testing. - This is an illustrated guide to the FEC team’s sprint, testing, and release cycle. Troubleshooting… Open source: 18F open source policy guide, specifically protecting sensitive information gov’s configuration management — this document is specific to cloud.gov, but it covers standard 18F practices List of security policies for cloud.gov OMB Federal Source Code Policy A post I have found very helpful by a former Presidential Innovation Fellow about open source: Why Open Source Open source code reviews: Each project team at 18F treats code review a little differently but documents it in a Team Practices document or a Contributing document. What all 18F teams have in common is that they use Github’s Pull Request and code review tools to facilitate code reviews. https://github.com/18F/identity-idp/pull/507 https://github.com/18F/identity-idp/pull/650 https://github.com/18F/identity-idp/pull/498 FOIA project’s pull request process FEC project’s pull request process"},{"title":"Welcome","url":"/","tags":[],"body":"This guide is for people at 18F who are wondering what to expect from a product manager on their team, as well as for product managers and those filling that role to understand what their team should expect from them. This guide also serves as a resource for product management best practices at 18F (generalized to apply to any of the specific types of product work we do, like Custom Partner Solutions (CPS) projects, product or platform work, consulting, etc.)"},{"title":"What to Cover - Gaining Insight","url":"/kick-off/what-to-cover-insight/","tags":[],"body":"In the workshop, you’ll need to align expectations and begin to understand the users and the problem. Why are we here? Why is this project worth doing? Your designers will usually lead this, but here are some topics you should make sure to cover: Who are the users? How will you recruit them for research and testing? What’s wrong with the status quo? Why is it this way? How are users currently solving this problem? How big is the problem? What size bite do they want to take out of it initially? The smaller the better. What’s in scope? What’s out of scope? What is the higher level vision and mission? One way to explore this is to ask what success would look like in 100 years, 15 years, and 5 years. Examine their assumptions and ask a lot of questions. Additionally, conducting exercises to align on expectations and potential problems are important. For each of these exercises, encourage folks to write their ideas on post-it notes for a few minutes, and then share them, clustering similar ideas. You may need to ask people to only share their most important ideas, depending on the number of attendees and time. Then, hold a discussion about major patterns and themes. This approach helps ensure contributions from everyone are heard, instead of a vocal minority. Hopes and fears: This can help dispel fear, uncertainty, and doubt, as well as meaningfully breaking the ice. Ask everyone to write down their hopes for the project on post-its, then their fears. Pre-mortem: This helps surface potential pitfalls or risks the team should know about. Ask everyone to imagine the project is completed and it failed, and then write down reasons it failed on post-its. Success: Best to end on a high note! This exercise helps surface priorities, and it’s especially useful for identifying any discrepancies between partners. Ask everyone to write down the one, most important thing that needs to happen to make the project a success. Some additional resources for good kick off workshops include: The #workshops channel and #strategy team Some templates from the workshop working group Kick Ass Kick Off Meetings by A List Apart"},{"title":"What to cover - Share","url":"/kick-off/what-to-cover-share/","tags":[],"body":"First, you’ll introduce your team and what to expect from us. Kick off your project by showing that you are a team of experts and professionals. This is helpful to start building trust with your partners, which is crucial to your project’s success. One way to do this is with a presentation: Address concerns that you’ve heard your partner might have Reinforce our core values Explain what they should expect: high level next steps, major milestones, and day-to-day communication Discuss questions This is also an important opportunity to provide your partner agency with training and intro guides (such as the 18F method cards). You need them to be your advocate, and this will help them significantly. Sometimes it even helps to ask the question bluntly: We know working with us is different — how can we help? Talking points, documents, etc? How can we help give you air cover and support you so you can provide us air cover? Bringing in a different or new consultant (that’s you) almost always means that someone inside the building took a big risk and vouched for us. We do not currently have official presentations, but we do have some great templates and resources to help you with this: High level recommendations from the Strategy team for a good presentation FOIA kickoff presentation and the Crime Data Explorer kickoff presentation Contact info is good to reiterate at the end. In addition, make sure you include contact info for an escalation path. Your business unit might have some templates they prefer. For reinforcing our values, the content in the 18F Partnership Playbook and the 18F guides are useful. Some additional topics you should review include: User-centered design and how we pivot or recommend against building features if we find that the users need something different. How your agile process will work. Theoretically agreeing to use agile and user-centered design and actually doing them can differ significantly. People often expect us to use the same methodologies and approaches that they have been using, just magically better. Agile often requires a giant leap of faith, because government traditionally mitigates risk through extensive planning and documentation before starting a project. Iterative releases and betas. Traditionally, government organizations wait to release projects until they are finished and perfect, usually with a big, splashy launch. This, of course, is not agile or lean. Discuss this with your partner early, and why releasing betas early and often is important to mitigating risk. The public is usually more understanding of imperfect betas if you are transparent about their limitations than agencies expect."},{"title":"Who To Invite","url":"/kick-off/who-to-invite/","tags":[],"body":""},{"skip_index":true,"title":"Search results","url":"/search/","tags":[],"body":""}]}